In [2]:
import pandas as pd

def display_pagadores(df: pd.DataFrame, colunas: list, eixo: str, alvo: str, comparativo: str):    
    for coluna in colunas:
        if coluna not in df.columns:
            raise ValueError(f"Coluna {coluna} não encontrada no DataFrame.")

    df_display = df[(df[eixo] == alvo)]
    for coluna in colunas:
        if (coluna == eixo) or (coluna == comparativo):
            continue
        
        dados = df_display[[coluna, comparativo]]

        coluna_rename = f'{coluna}_{alvo.upper()}'
        dados = dados.rename(columns={coluna : coluna_rename})
        
        contagem = dados.groupby([coluna_rename])[comparativo].value_counts().unstack()
        porcentagem = ((contagem.divide(contagem.sum(axis=1), axis=0) * 100).round(2)).reset_index().dropna()

        display(porcentagem)

df_pagadores = pd.read_csv('dados/df_pagadores.csv')

for column in df_pagadores.columns:
    for value in df_pagadores[column].unique():
        display_pagadores(df=df_pagadores, colunas=df_pagadores.columns, eixo=column, alvo=value, comparativo='STATUS_PGTO_SEPTEMBER')

STATUS_PGTO_SEPTEMBER,EDUCATION_MULHER,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,8.43,25.12,50.12,16.34
1,Graduação,8.35,22.45,53.16,16.04
2,Pós-graduação,14.36,19.80,39.40,26.44

STATUS_PGTO_SEPTEMBER,MARRIAGE_MULHER,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,11.05,23.22,45.47,20.26
1,Solteiro,9.98,20.79,49.93,19.30

STATUS_PGTO_SEPTEMBER,AGE_RANGES_MULHER,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Adulto,11.21,20.84,47.26,20.69
1,Jovem Adulto,4.41,25.75,56.56,13.28
2,Meia-idade,12.20,22.17,44.21,21.42
3,Terceira idade,17.39,23.91,47.83,10.87

STATUS_PGTO_SEPTEMBER,EDUCATION_HOMEM,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,5.12,27.91,52.38,14.59
1,Graduação,4.99,25.76,56.19,13.06
2,Pós-graduação,11.20,20.53,42.57,25.70

STATUS_PGTO_SEPTEMBER,MARRIAGE_HOMEM,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,8.60,24.25,46.68,20.47
1,Solteiro,6.33,24.10,53.46,16.12

STATUS_PGTO_SEPTEMBER,AGE_RANGES_HOMEM,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Adulto,7.71,23.87,50.12,18.30
1,Jovem Adulto,1.86,28.70,57.30,12.14
2,Meia-idade,8.31,23.23,49.12,19.34
3,Terceira idade,8.51,29.79,42.55,19.15

STATUS_PGTO_SEPTEMBER,SEX_GRADUAÇÃO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,4.99,25.76,56.19,13.06
1,Mulher,8.35,22.45,53.16,16.04

STATUS_PGTO_SEPTEMBER,MARRIAGE_GRADUAÇÃO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,8.36,23.62,51.36,16.66
1,Solteiro,5.78,23.82,57.24,13.16

STATUS_PGTO_SEPTEMBER,AGE_RANGES_GRADUAÇÃO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Adulto,7.07,23.42,54.74,14.76
1,Jovem Adulto,3.39,27.94,58.12,10.56
2,Meia-idade,9.16,21.86,51.30,17.67
3,Terceira idade,15.38,19.23,42.31,23.08

STATUS_PGTO_SEPTEMBER,SEX_PÓS-GRADUAÇÃO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,11.20,20.53,42.57,25.70
1,Mulher,14.36,19.80,39.40,26.44

STATUS_PGTO_SEPTEMBER,MARRIAGE_PÓS-GRADUAÇÃO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,15.14,21.47,33.20,30.19
1,Solteiro,11.92,19.35,44.82,23.91

STATUS_PGTO_SEPTEMBER,AGE_RANGES_PÓS-GRADUAÇÃO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Adulto,13.40,19.43,40.77,26.40
1,Jovem Adulto,4.51,22.23,54.71,18.55
2,Meia-idade,16.05,20.89,34.07,28.99
3,Terceira idade,8.33,37.50,41.67,12.50

STATUS_PGTO_SEPTEMBER,SEX_ENSINO MÉDIO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,5.12,27.91,52.38,14.59
1,Mulher,8.43,25.12,50.12,16.34

STATUS_PGTO_SEPTEMBER,MARRIAGE_ENSINO MÉDIO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,7.80,26.37,49.49,16.34
1,Solteiro,6.01,26.06,53.36,14.56

STATUS_PGTO_SEPTEMBER,AGE_RANGES_ENSINO MÉDIO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Adulto,7.83,26.12,50.64,15.41
1,Jovem Adulto,2.70,31.27,54.99,11.05
2,Meia-idade,7.14,25.51,50.70,16.64
3,Terceira idade,13.95,25.58,48.84,11.63

STATUS_PGTO_SEPTEMBER,SEX_CASADO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,8.60,24.25,46.68,20.47
1,Mulher,11.05,23.22,45.47,20.26

STATUS_PGTO_SEPTEMBER,EDUCATION_CASADO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,7.80,26.37,49.49,16.34
1,Graduação,8.36,23.62,51.36,16.66
2,Pós-graduação,15.14,21.47,33.20,30.19

STATUS_PGTO_SEPTEMBER,AGE_RANGES_CASADO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Adulto,9.73,23.55,47.12,19.59
1,Jovem Adulto,2.60,29.17,56.51,11.72
2,Meia-idade,10.94,23.28,44.06,21.72
3,Terceira idade,14.46,25.30,44.58,15.66

STATUS_PGTO_SEPTEMBER,SEX_SOLTEIRO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,6.33,24.10,53.46,16.12
1,Mulher,9.98,20.79,49.93,19.30

STATUS_PGTO_SEPTEMBER,EDUCATION_SOLTEIRO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,6.01,26.06,53.36,14.56
1,Graduação,5.78,23.82,57.24,13.16
2,Pós-graduação,11.92,19.35,44.82,23.91

STATUS_PGTO_SEPTEMBER,AGE_RANGES_SOLTEIRO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Adulto,9.89,21.07,49.19,19.85
1,Jovem Adulto,3.77,26.32,56.82,13.09
2,Meia-idade,9.13,20.71,53.30,16.87

STATUS_PGTO_SEPTEMBER,SEX_JOVEM ADULTO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,1.86,28.70,57.30,12.14
1,Mulher,4.41,25.75,56.56,13.28

STATUS_PGTO_SEPTEMBER,EDUCATION_JOVEM ADULTO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,2.70,31.27,54.99,11.05
1,Graduação,3.39,27.94,58.12,10.56
2,Pós-graduação,4.51,22.23,54.71,18.55

STATUS_PGTO_SEPTEMBER,MARRIAGE_JOVEM ADULTO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,2.60,29.17,56.51,11.72
1,Solteiro,3.77,26.32,56.82,13.09

STATUS_PGTO_SEPTEMBER,SEX_ADULTO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,7.71,23.87,50.12,18.30
1,Mulher,11.21,20.84,47.26,20.69

STATUS_PGTO_SEPTEMBER,EDUCATION_ADULTO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,7.83,26.12,50.64,15.41
1,Graduação,7.07,23.42,54.74,14.76
2,Pós-graduação,13.40,19.43,40.77,26.40

STATUS_PGTO_SEPTEMBER,MARRIAGE_ADULTO,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,9.73,23.55,47.12,19.59
1,Solteiro,9.89,21.07,49.19,19.85

STATUS_PGTO_SEPTEMBER,SEX_MEIA-IDADE,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,8.31,23.23,49.12,19.34
1,Mulher,12.20,22.17,44.21,21.42

STATUS_PGTO_SEPTEMBER,EDUCATION_MEIA-IDADE,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,7.14,25.51,50.70,16.64
1,Graduação,9.16,21.86,51.30,17.67
2,Pós-graduação,16.05,20.89,34.07,28.99

STATUS_PGTO_SEPTEMBER,MARRIAGE_MEIA-IDADE,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,10.94,23.28,44.06,21.72
1,Solteiro,9.13,20.71,53.30,16.87

STATUS_PGTO_SEPTEMBER,SEX_TERCEIRA IDADE,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Homem,8.51,29.79,42.55,19.15
1,Mulher,17.39,23.91,47.83,10.87

STATUS_PGTO_SEPTEMBER,EDUCATION_TERCEIRA IDADE,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Ensino Médio,13.95,25.58,48.84,11.63
1,Graduação,15.38,19.23,42.31,23.08
2,Pós-graduação,8.33,37.50,41.67,12.50

STATUS_PGTO_SEPTEMBER,MARRIAGE_TERCEIRA IDADE,Abriu conta no mês,Em atraso,Pagou o mínimo,Pagou totalmente
0,Casado,14.46,25.3,44.58,15.66

STATUS_PGTO_SEPTEMBER SEX_EM ATRASO  Em atraso
0                             Homem      100.0
1                            Mulher      100.0

STATUS_PGTO_SEPTEMBER EDUCATION_EM ATRASO  Em atraso
0                            Ensino Médio      100.0
1                               Graduação      100.0
2                           Pós-graduação      100.0

STATUS_PGTO_SEPTEMBER MARRIAGE_EM ATRASO  Em atraso
0                                 Casado      100.0
1                               Solteiro      100.0

STATUS_PGTO_SEPTEMBER AGE_RANGES_EM ATRASO  Em atraso
0                                   Adulto      100.0
1                             Jovem Adulto      100.0
2                               Meia-idade      100.0
3                           Terceira idade      100.0

STATUS_PGTO_SEPTEMBER SEX_PAGOU TOTALMENTE  Pagou totalmente
0                                    Homem             100.0
1                                   Mulher             100.0

STATUS_PGTO_SEPTEMBER EDUCATION_PAGOU TOTALMENTE  Pagou totalmente
0                                   Ensino Médio             100.0
1                                      Graduação             100.0
2                                  Pós-graduação             100.0

STATUS_PGTO_SEPTEMBER MARRIAGE_PAGOU TOTALMENTE  Pagou totalmente
0                                        Casado             100.0
1                                      Solteiro             100.0

STATUS_PGTO_SEPTEMBER AGE_RANGES_PAGOU TOTALMENTE  Pagou totalmente
0                                          Adulto             100.0
1                                    Jovem Adulto             100.0
2                                      Meia-idade             100.0
3                                  Terceira idade             100.0

STATUS_PGTO_SEPTEMBER SEX_PAGOU O MÍNIMO  Pagou o mínimo
0                                  Homem           100.0
1                                 Mulher           100.0

STATUS_PGTO_SEPTEMBER EDUCATION_PAGOU O MÍNIMO  Pagou o mínimo
0                                 Ensino Médio           100.0
1                                    Graduação           100.0
2                                Pós-graduação           100.0

STATUS_PGTO_SEPTEMBER MARRIAGE_PAGOU O MÍNIMO  Pagou o mínimo
0                                      Casado           100.0
1                                    Solteiro           100.0

STATUS_PGTO_SEPTEMBER AGE_RANGES_PAGOU O MÍNIMO  Pagou o mínimo
0                                        Adulto           100.0
1                                  Jovem Adulto           100.0
2                                    Meia-idade           100.0
3                                Terceira idade           100.0

STATUS_PGTO_SEPTEMBER SEX_ABRIU CONTA NO MÊS  Abriu conta no mês
0                                      Homem               100.0
1                                     Mulher               100.0

STATUS_PGTO_SEPTEMBER EDUCATION_ABRIU CONTA NO MÊS  Abriu conta no mês
0                                     Ensino Médio               100.0
1                                        Graduação               100.0
2                                    Pós-graduação               100.0

STATUS_PGTO_SEPTEMBER MARRIAGE_ABRIU CONTA NO MÊS  Abriu conta no mês
0                                          Casado               100.0
1                                        Solteiro               100.0

STATUS_PGTO_SEPTEMBER AGE_RANGES_ABRIU CONTA NO MÊS  Abriu conta no mês
0                                            Adulto               100.0
1                                      Jovem Adulto               100.0
2                                        Meia-idade               100.0
3                                    Terceira idade               100.0